//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2020, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************

/** @file Nb.uni
    This contains the unicode strings pertaining to NB

**/


/=#
#include "VFR.uni"
#string STR_MEMORY_INFORMATION          #language eng "Memory Information"
#string STR_MEMORY_SIZE_NAME            #language eng "Total Memory"
#string STR_MEMORY_SIZE_VALUE           #language eng "N/A" // Dynamically updated
#string STR_MEMORY_SIZE_HELP            #language eng "Total Memory in the System."

#string STR_PLATFORM_INFORMATION        #language en-US "Platform Information"
#string STR_PLATFORM_INFO_PROMPT        #language en-US "Platform"
#string STR_PLATFORM_INFO_VALUE         #language en-US "Unknown"

#string STR_REFCODE_REVISION_PROMPT     #language en-US "RC Revision"
#string STR_REFCODE_REVISION_VALUE      #language en-US "Unknown"


#string STR_PROCESSOR_INFO_PROMPT       #language en-US "Processor"
#string STR_PROCESSOR_INFO_VALUE        #language en-US "Unknown"


#string STR_PCH_INFO_PROMPT             #language en-US "PCH"
#string STR_PCH_INFO_VALUE              #language en-US "Unknown"

#string STR_BIOS_ACM_PROMPT             #language en-US "BIOS ACM "
#string STR_BIOS_ACM_VALUE              #language en-US "Unknown"

#string STR_SINIT_ACM_PROMPT             #language en-US "SINIT ACM "
#string STR_SINIT_ACM_VALUE              #language en-US "Unknown"

#string STR_OPTIMIZED_BOOT              #language eng "Optimized Boot"
#string STR_OPTIMIZED_BOOT_HELP         #language eng "Enables or disables Optimized Boot. Enabling Optimized Boot will disable Csm support and disable connecting Network devices to decrease boot time. While disabling Optimized Boot, make sure to restore Csm Support option to previous value before enabling Optimized Boot."

#string STR_ENABLE                      #language eng "Enabled"
#string STR_DISABLE                     #language eng "Disabled"

